In [1]:
import pandas as pd

In [2]:
zonas = pd.read_excel('Matrices/CÃ³digos de Zonas_tp.xlsx')

cargas = pd.read_excel('Matrices/Matrices Grupo Mineria_tp.xlsx')
cargas.drop('Unnamed: 0', axis=1, inplace=True)

df_distancias = pd.read_excel('Matrices/Matriz distancias_tp_1.xlsx')
df_distancias.drop('Unnamed: 0', axis=1, inplace=True)

criterio=pd.read_excel('Matrices/Criterios de derivabilidad_tp.xlsx', sheet_name='MINERIA')

In [3]:
cargas

        1         2        3      4
0   39319    133000     1300  50000
1       0     34000     2200  15000
2   16948   1325674  4200000  65000
3  275000  12000000        0  10000

In [4]:
cargas.iat[0,1]

133000

In [5]:
cargas[1][0]

39319

##### conjunto['Carga'] = df_producto[(y+1)][x]

In [6]:
df_distancias

   1    2  3  4
0  0  500  0  0
1  0    0  0  0
2  0  750  0  0
3  0  200  0  0

In [7]:
df_distancias.iat[2,1]

750

In [8]:
zonas

   ID CODIGO ZONA     PROVINCIA      CENTROIDE
0   1         BOL  BUENOS AIRES      OLAVARRIA
1   2         BTA  BUENOS AIRES           CABA
2   3         CLC       CORDOBA     LA CARLOTA
3   4         SVT      SANTA FE  VENADO TUERTO

In [9]:
zonas.iat[0,3]

'OLAVARRIA'

In [10]:
criterio

   toneladas    400    300    200    100
0     120000  0.510  0.427  0.338  0.255
1      82333  0.427  0.338  0.255  0.172
2      44670  0.338  0.255  0.172  0.083
3       7000  0.255  0.172  0.083  0.000

In [11]:
criterio.iat[0,0]

120000

In [12]:
lista_cargas = [{'Origen': 'OLAVARRIA',
  'ID origen': 1,
  'Destino': 'OLAVARRIA',
  'ID destino': 1,
  'Carga': 39319,
  'Distancia': 0},
 {'Origen': 'CABA',
  'ID origen': 2,
  'Destino': 'OLAVARRIA',
  'ID destino': 1,
  'Carga': 0,
  'Distancia': 0},
 {'Origen': 'LA CARLOTA',
  'ID origen': 3,
  'Destino': 'OLAVARRIA',
  'ID destino': 1,
  'Carga': 16948,
  'Distancia': 0},
 {'Origen': 'VENADO TUERTO',
  'ID origen': 4,
  'Destino': 'OLAVARRIA',
  'ID destino': 1,
  'Carga': 275000,
  'Distancia': 0},
 {'Origen': 'OLAVARRIA',
  'ID origen': 1,
  'Destino': 'CABA',
  'ID destino': 2,
  'Carga': 133000,
  'Distancia': 500},
 {'Origen': 'CABA',
  'ID origen': 2,
  'Destino': 'CABA',
  'ID destino': 2,
  'Carga': 34000,
  'Distancia': 0},
 {'Origen': 'LA CARLOTA',
  'ID origen': 3,
  'Destino': 'CABA',
  'ID destino': 2,
  'Carga': 1325674,
  'Distancia': 750},
 {'Origen': 'VENADO TUERTO',
  'ID origen': 4,
  'Destino': 'CABA',
  'ID destino': 2,
  'Carga': 12000000,
  'Distancia': 200},
 {'Origen': 'OLAVARRIA',
  'ID origen': 1,
  'Destino': 'LA CARLOTA',
  'ID destino': 3,
  'Carga': 1300,
  'Distancia': 0},
 {'Origen': 'CABA',
  'ID origen': 2,
  'Destino': 'LA CARLOTA',
  'ID destino': 3,
  'Carga': 2200,
  'Distancia': 0},
 {'Origen': 'LA CARLOTA',
  'ID origen': 3,
  'Destino': 'LA CARLOTA',
  'ID destino': 3,
  'Carga': 4200000,
  'Distancia': 0},
 {'Origen': 'VENADO TUERTO',
  'ID origen': 4,
  'Destino': 'LA CARLOTA',
  'ID destino': 3,
  'Carga': 0,
  'Distancia': 0},
 {'Origen': 'OLAVARRIA',
  'ID origen': 1,
  'Destino': 'VENADO TUERTO',
  'ID destino': 4,
  'Carga': 50000,
  'Distancia': 0},
 {'Origen': 'CABA',
  'ID origen': 2,
  'Destino': 'VENADO TUERTO',
  'ID destino': 4,
  'Carga': 15000,
  'Distancia': 0},
 {'Origen': 'LA CARLOTA',
  'ID origen': 3,
  'Destino': 'VENADO TUERTO',
  'ID destino': 4,
  'Carga': 65000,
  'Distancia': 0},
 {'Origen': 'VENADO TUERTO',
  'ID origen': 4,
  'Destino': 'VENADO TUERTO',
  'ID destino': 4,
  'Carga': 10000,
  'Distancia': 0}]

In [13]:
derivable = []
for i in lista_cargas:
        conjunto = {}
        conjunto['Origen'] = i['Origen']
        conjunto['ID origen'] = i['ID origen']
        conjunto['Distancia'] = i['Distancia']
        conjunto['ID destino'] = i['ID destino']
        conjunto['Destino'] = i['Destino']
        derivable.append(conjunto)

In [14]:
derivable[2]

{'Origen': 'LA CARLOTA',
 'ID origen': 3,
 'Distancia': 0,
 'ID destino': 1,
 'Destino': 'OLAVARRIA'}

In [15]:
lista=[{'luis':'jugador','carlos':'2'},{'luis':'maestra','carlos':'3'}]

In [16]:
listalc=[{'luis':'jugador','carlos':'4'},{'luis':'maestra','carlos':'10'}]




dr=[]
for i in lista:
    con={}
    con['luis'] = i['luis']
    con['carlos'] = i['carlos']
    dr.append(con)
    

dr

lista[1]

###### data_c = [ {'A': 5, 'B': 0, 'C': 3, 'D': 3}, {'A': 7, 'B': 9, 'C': 3, 'D': 5}, {'A': 2, 'B': 4, 'C': 7, 'D': 6}] 

pd.DataFrame.from_dict(data_c, orient='columns') A B C D 0 5 0 3 3 1 7 9 3 5 2 2 4 7 6

Fuente: https://www.iteramos.com/pregunta/84351/convertir-una-lista-de-diccionarios-en-un-dataframe-de-pandas

In [17]:
ds1=pd.DataFrame.from_dict(lista,orient='columns')

In [18]:
k1=((ds1['carlos'].astype(int))*1)
k1

0    2
1    3
Name: carlos, dtype: int32

In [19]:
ds1['carlos']

0    2
1    3
Name: carlos, dtype: object

In [20]:
ds2=pd.DataFrame.from_dict(listalc,orient='columns')

In [21]:
ds2.iat[0,1]

'4'

In [22]:
ds2

      luis carlos
0  jugador      4
1  maestra     10

In [23]:
k2=((ds2['carlos'].astype(int))*1)
k2

0     4
1    10
Name: carlos, dtype: int32

In [24]:
kt=k1.add(k2)

In [25]:
kt

0     6
1    13
Name: carlos, dtype: int32